# 05-06-2020
Document: [click here](https://tinyurl.com/python-pandas-day11)

In [1]:
from numpy import random
print(random.randint(1,100)) #random int in given range
print(random.rand()) #float number btwn 0-1

37
0.8967164767894863

In [2]:
#creating an n-D array using random
print(random.randint(100,size=(3))) #size=('size of array')
print(random.randint(100,size=(5,4)))
print(random.randint(100,size=(5,4,3)))           ##these are all integer arrays
print(random.randint(100,size=(5,4,3,2)))

[48 40 43]
[[74 91 16 94]
 [25 14 76 57]
 [38 79 95 45]
 [36 22 70 24]
 [28 40 53  3]]
[[[67 77 37]
  [80 68 73]
  [25 95 67]
  [98 73 49]]

 [[49 50  3]
  [66 38 74]
  [61 83 72]
  [31 47 54]]

 [[85 45 50]
  [76 47 63]
  [22 83 58]
  [55 42 35]]

 [[71 48 90]
  [43 23 43]
  [ 0 45 43]
  [ 2 43 22]]

 [[65 70 41]
  [90 11 94]
  [58 92 82]
  [84 61  2]]]
[[[[98 37]
   [86 97]
   [71  6]]

  [[74  6]
   [11 31]
   [38 36]]

  [[33 25]
   [76  3]
   [99 27]]

  [[32 31]
   [34  7]
   [10 58]]]


 [[[32 20]
   [86 88]
   [77 35]]

  [[83  7]
   [ 7 37]
   [68  0]]

  [[86 67]
   [ 4 50]
   [47 69]]

  [[12 86]
   [70 77]
   [65 10]]]


 [[[37 25]
   [57 87]
   [85 35]]

  [[57 31]
   [75  2]
   [ 4 41]]

  [[ 9 61]
   [31 47]
   [17  8]]

  [[87 27]
   [23 81]
   [26 28]]]


 [[[86 90]
   [ 9 25]
   [16  8]]

  [[60 47]
   [47 47]
   [64 45]]

  [[44 44]
   [23 72]
   [91  5]]

  [[64 77]
   [ 6 78]
   [52 33]]]


 [[[80 56]
   [61 31]
   [63 33]]

  [[94 19]
   [27 86]
   [43 23]]

  [[30 49]
   [52 57]
   [57 14]]

  [[58 58]
   [38 32]
   [46 28]]]]

In [3]:
#creating n-D arrays using random with float values
print(random.rand())
print(random.rand(3))
print(random.rand(4,3))

0.2126992823581254
[0.71048013 0.69801401 0.72879443]
[[0.86452718 0.90246649 0.33541455]
 [0.55611442 0.75590529 0.89773322]
 [0.59953949 0.47707482 0.18622867]
 [0.75281967 0.28336527 0.14540779]]

In [7]:
a=random.randint(100,size=(3,4)).ravel()
a

array([75, 99, 97,  8, 79,  1, 59, 25, 90, 15, 67, 75])

In [8]:
random.choice(a)

75

In [9]:
#to generate a random array from a given list of array and in a given shape
random.choice([1,2,3,4,5],size=(3,4))

array([[2, 1, 3, 3],
       [1, 2, 4, 1],
       [3, 2, 4, 5]])

## PANDAS:
1. Data Manipulations
2. Data Analysis
3. Data Cleaning

Kinds of data:
1. Tabular Data
2. Unlabelled Data

#### creating DataFrame:
1. using 2 Dictionaries

In [23]:
import pandas as pd
import numpy as np
dict1={'a':1,'b':2,'c':3,'d':4,'e':5}
dict2={'a':5,'b':6,'c':7,'d':8,'e':9}
data={'first':dict1,'second':dict2}
df1=pd.DataFrame(data,dtype=np.float) #data type of values in the DataFrame
df

   first  second
a    1.0     5.0
b    2.0     6.0
c    3.0     7.0
d    4.0     8.0
e    5.0     NaN
f    NaN     9.0

In [24]:
import pandas as pd
import numpy as np
dict1={'a':1,'b':2,'c':3,'d':4,'e':5}
dict2={'a':5,'b':6,'c':7,'d':8,'f':9}
data={'first':dict1,'second':dict2}
df2=pd.DataFrame(data,dtype=np.int) #when we have 'NaN' values in the DataFrame we cannot change the DataType of the values
df       #Default DataType when 'Nan' values are present is 'FLOAT'

   first  second
a    1.0     5.0
b    2.0     6.0
c    3.0     7.0
d    4.0     8.0
e    5.0     NaN
f    NaN     9.0

#### DataFrame Using Series:

In [29]:
s1=pd.Series([1,2,3,4,5,6,7,8,9,10])
s2=pd.Series([12.23,23.34,45.3,45.5,67.4,67.78,34.45,23.34,67.4,23]) # mind it the 'S' in series is UPPERCASE.
s3=pd.Series(['a','b','c','d','e','f','g','h','i','j'])
data1={'column1':s1,'column2':s2,'column3':s3}
df3=pd.DataFrame(data1)
df3

   column1  column2 column3
0        1    12.23       a
1        2    23.34       b
2        3    45.30       c
3        4    45.50       d
4        5    67.40       e
5        6    67.78       f
6        7    34.45       g
7        8    23.34       h
8        9    67.40       i
9       10    23.00       j

## Selecting the data from DataFrame:
1. loc ----> row and column labels
2. iloc ---> row and column indexes

In [30]:
df3['column3']

0    a
1    b
2    c
3    d
4    e
5    f
6    g
7    h
8    i
9    j
Name: column3, dtype: object

In [32]:
df3[['column2','column3']]

   column2 column3
0    12.23       a
1    23.34       b
2    45.30       c
3    45.50       d
4    67.40       e
5    67.78       f
6    34.45       g
7    23.34       h
8    67.40       i
9    23.00       j

In [36]:
#using 'loc'
df3.loc[1:5,'column1'] #syntax--> datafram_name.loc[start-of-row:end-of-row,column-name]
 #or --> datafram_name.loc[start-of-row:end-of-row,[column1,column2,.....,column n]

1    2
2    3
3    4
4    5
5    6
Name: column1, dtype: int64

In [37]:
df3.loc[0:5,['column1','column2']]

   column1  column2
0        1    12.23
1        2    23.34
2        3    45.30
3        4    45.50
4        5    67.40
5        6    67.78

In [38]:
#using 'iloc'
df3.iloc[:,0] #syntax --> data-frame.iloc[row-start:row-stop,coloumn-range-same as- row-range]

0     1
1     2
2     3
3     4
4     5
5     6
6     7
7     8
8     9
9    10
Name: column1, dtype: int64

In [52]:
df3.iloc[1:5,1]

1    23.34
2    45.30
3    45.50
4    67.40
Name: column2, dtype: float64

### Retrieving the information of DataFrame:

In [55]:
df3.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 3 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   column1  10 non-null     int64
 1   column2  10 non-null     float64
 2   column3  10 non-null     object
dtypes: float64(1), int64(1), object(1)
memory usage: 368.0+ bytes

In [56]:
df3.shape

(10, 3)

In [57]:
df3.columns

Index(['column1', 'column2', 'column3'], dtype='object')

In [58]:
df3.index

RangeIndex(start=0, stop=10, step=1)

In [59]:
df3.index

RangeIndex(start=0, stop=10, step=1)

### Viewing Data from DataFrame:
1. head()
2. tall()
3. sample()

In [60]:
#first five rows
df3.head() #syntax -->head('args') -->from top args def=5

   column1  column2 column3
0        1    12.23       a
1        2    23.34       b
2        3    45.30       c
3        4    45.50       d
4        5    67.40       e

In [61]:
#last 5 rows
df3.tail() #syntax -->tail('args') -->from bottom args def=5

   column1  column2 column3
5        6    67.78       f
6        7    34.45       g
7        8    23.34       h
8        9    67.40       i
9       10    23.00       j

In [62]:
#random row
df3.sample() #syntax -->sample('args') -->random 'args' number of rows [def=5]

   column1  column2 column3
6        7    34.45       g

In [63]:
df3.sample(3)

   column1  column2 column3
2        3    45.30       c
5        6    67.78       f
6        7    34.45       g

In [64]:
#statistics of the data -describe()
df3.describe()

        column1    column2
count  10.00000  10.000000
mean    5.50000  40.974000
std     3.02765  20.997852
min     1.00000  12.230000
25%     3.25000  23.340000
50%     5.50000  39.875000
75%     7.75000  61.925000
max    10.00000  67.780000

#### renaming the columns:

In [66]:
df3=df3.rename(columns={'column1':'First','column2':'Second','column3':'Third'})
df3

   First  Second Third
0      1   12.23     a
1      2   23.34     b
2      3   45.30     c
3      4   45.50     d
4      5   67.40     e
5      6   67.78     f
6      7   34.45     g
7      8   23.34     h
8      9   67.40     i
9     10   23.00     j